src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ЗаявкаНаРасходДС</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <registerRecords>AccumulationRegister.Подотчет</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииРасходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПКО</name>
    <type>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПодотчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходДС</types>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Пост</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКомиссии</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ВидОперацииРасходныйКассовыйОрдер/ВидОперацииРасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииРасходныйКассовыйОрдер</name>
  <enumValues>
    <name>ВыдачаВПодотчет</name>
  </enumValues>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>Оплата</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеВКассу</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидОперацииПриходныйКассовыйОрдер/ВидОперацииПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииПриходныйКассовыйОрдер</name>
  <enumValues>
    <name>Конвертация</name>
  </enumValues>
  <enumValues>
    <name>ОплатаКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеИзКассы</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходныйКассовыйОрдер</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииПриходныйКассовыйОрдер</types>
    </type>
  </attributes>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолгПоВалютам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаПеремещение</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДолгГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ГТД/ГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГТД</name>
  <basedOn>Document.Контроль</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ДатаГТД</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>DocumentRef.Контроль</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнвойса</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока020</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСтрока028</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт1</name>
    <type>
      <types>DefinedType.Транспорт</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контроль</name>
      <type>
        <types>DocumentRef.Контроль</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГТД</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИнвойса</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока020</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока028</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗаявкаНаРасходДС/ЗаявкаНаРасходДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРасходДС</name>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/РасходныйКассовыйОрдер/ObjectModule.bsl
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	Если ( ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.ПеремещениеВКассу ) Тогда
		заполнитьОплаты ();		
	КонецЕсли;
	Если ( ПометкаУдаления И ЗначениеЗаполнено ( ДокументПКО ) ) Тогда
		// помечаем на удаление
		докОбъект = ДокументПКО.ПолучитьОбъект ();
		докОбъект.ПометкаУдаления = Истина;
		докОбъект.Проведен = Ложь;
		докОбъект.Записать ();
	КонецЕсли; 
	
КонецПроцедуры

Процедура заполнитьОплаты ()
	
	колвоСтрок = Оплаты.Количество ();
	Если ( колвоСтрок = 0 ) Тогда
		новая = Оплаты.Добавить ();
		новая.Валюта = Валюта;
		новая.Сумма = Сумма;
	ИначеЕсли ( колвоСтрок = 1 ) Тогда 
		строкаТЧ = Оплаты [ 0 ];  
		Если ( Валюта = строкаТЧ.Валюта ) Тогда
			строкаТЧ.Курс = 1;
		КонецЕсли;	
	Иначе
		// мультивалютный документ
	КонецЕсли; 
	
КонецПроцедуры	

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура ();
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.РасходныйКассовыйОрдер.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка )
	
	типДанныеЗаполнения = ТипЗнч ( ДанныеЗаполнения );
	Если ( типДанныеЗаполнения = Тип ( "ДокументСсылка.ГТД" ) ) Тогда
		заполнитьПоГТД ( ДанныеЗаполнения );
	ИначеЕсли ( типДанныеЗаполнения = Тип ( "ДокументСсылка.ПриходныйКассовыйОрдер" ) ) Тогда 
		заполнитьПоПКО ( ДанныеЗаполнения );
	ИначеЕсли ( типДанныеЗаполнения = Тип ( "ДокументСсылка.ЗаявкаНаРасходДС" ) ) Тогда 
		заполнитьПоЗаявке ( ДанныеЗаполнения );
	КонецЕсли; 
	
КонецПроцедуры

Процедура заполнитьПоПКО ( ПКО )
	
	с = "
	|выбрать
	|	ВидОперации как ВидОперации, 
	|	Ссылка как Ссылка, 
	|	Контрагент как Контрагент,
	|	Касса как Касса,
	|	Организация как Организация,
	|	СтатьяДДС как СтатьяДДС
	|из
	|	Документ.ПриходныйКассовыйОрдер
	|где
	|	Ссылка = &ПКО  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "ПКО", ПКО );
	результат = запрос.Выполнить ();
	Если ( результат.Пустой () ) Тогда
		// код ...
	Иначе
		выборка = результат.Выбрать ();
		выборка.Следующий ();
		Если ( выборка.ВидОперации = Перечисления.ВидОперацииПриходныйКассовыйОрдер.Конвертация ) Тогда
			Контрагент = выборка.Контрагент;
			Касса = выборка.Касса;
			Организация = выборка.Организация;
			СтатьяДДС = выборка.СтатьяДДС;
			ДокументПКО = выборка.Ссылка;
			ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.Конвертация;
		Иначе
			ВызватьИсключение ( "Можно создавать документ на основании, только если вид операции ""Конвертация""!" );
		КонецЕсли; 
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоГТД  ( ДанныеЗаполнения )
	
	данные = получитьДанныеГТД ( ДанныеЗаполнения );
	Сумма = данные.Сумма;
	Контрагент = данные.Контрагент;
	ГТД = данные.ГТД;
	Организация = данные.Организация;
	ДатаОперации = ТекущаяДата ();
	
КонецПроцедуры 

Функция получитьДанныеГТД ( ГТД )
	
	с = "
	|выбрать
	|	сумма ( естьnull ( ТЧТранспорт.Цена, 0 ) ) как Сумма,
	|	ДокГТД.Контрагент как Контрагент, ДокГТД.Ссылка как ГТД,
	|	ДокГТД.Организация как Организация
	|из
	|	Документ.ГТД как ДокГТД
	|	левое соединение Документ.ГТД.Транспорт как ТЧТранспорт
	|	по ТЧТранспорт.Ссылка = &ГТД  
	|где
	|	ДокГТД.Ссылка = &ГТД
	|сгруппировать по
	|	ДокГТД.Ссылка 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "ГТД", ГТД );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();	
	Возврат выборка;

КонецФункции

Процедура заполнитьПоЗаявке ( Заявка )
	
	с = "
	|выбрать
	|	Ссылка как Ссылка, 
	|	ДатаЗаявки как ДатаЗаявки, 
	|	ДатаПлатежа как ДатаПлатежа, 
	|	Заявитель как Заявитель,
	|	Оплачена как Оплачена,
	|	Получатель как Получатель,
	|	Приоритет как Приоритет,
	|	СтатусЗаявки как СтатусЗаявки,
	|	СтатьяДДС как СтатьяДДС,
	|	Организация как Организация,
	|	Валюта как Валюта,
	|	Комментарий как Комментарий,
	|	Ответственный как Ответственый,
	|	Сумма как Сумма 
	|из
	|	Документ.ЗаявкаНаРасходДС
	|где
	|	Ссылка = &Заявка  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Заявка", Заявка );
	результат = запрос.Выполнить ();
	Если ( результат.Пустой () ) Тогда
		// код ...
	Иначе
		выборка = результат.Выбрать ();
		выборка.Следующий ();
		Валюта = выборка.Валюта;
		Сумма = выборка.Сумма;
		Сотрудник = выборка.Получатель;
		Организация = выборка.Организация;
		СтатьяДДС = выборка.СтатьяДДС;
		Основание = выборка.Ссылка;
		ВидОперации = Перечисления.ВидОперацииРасходныйКассовыйОрдер.ВыдачаВПодотчет;
		новая = Оплаты.Добавить ();
		новая.Сумма = Сумма;
		новая.Валюта = Валюта;
		новая.Курс = 1;
	КонецЕсли;
	
КонецПроцедуры
